
Перем юТест;

Функция ПолучитьСписокТестов(Знач Тесты) Экспорт
	юТест = Тесты;
	
	Список = Новый Массив;
	Список.Добавить("ТестДолжен_ПроверитьЧтоМетодВызывается");
	Список.Добавить("ТестДолжен_ПроверитьЧтоСобытиеВызываетсяОднажды");

	Возврат Список;
	
КонецФункции


Процедура ТестДолжен_ПроверитьЧтоМетодВызывается() Экспорт
	ТекПуть = Новый Файл(ТекущийСценарий().Источник).Путь;
	ПодключитьСценарий(ОбъединитьПути(ТекПуть,"testdata", "thisObjClass.os") , "ТестовыйОбъект");

	Объект = Новый ТестовыйОбъект;
	Объект.НесуществующийМетод(1,2,3);

КонецПроцедуры