Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;	
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");
	
	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	Фабрика = Новый ФабрикаXDTO;
	
	ЮнитТест.ПроверитьРавенство(ТипЗнч(Фабрика), Тип("ФабрикаXDTO"));
	ЮнитТест.ПроверитьБольше(Фабрика.Пакеты.Количество(), 0);
	
КонецПроцедуры

Procedure TestConstructor() Export

	Factory = New XDTOFactory;
	
	ЮнитТест.ПроверитьРавенство(TypeOf(Factory), Type("XDTOFactory"));

EndProcedure

#КонецОбласти

Если СтартовыйСценарий().Источник = ТекущийСценарий().Источник Тогда
	
	ФабрикаXDTO = Новый ФабрикаXDTO;

	ТипXDTO = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "UUID");
	//ТипXDTO.Вариант = ВариантXDTO.Атомарный;
	//ТипXDTO.БазовыйТип = {http://www.w3.org/2001/XMLSchema}string

	Сообщить(ТекущаяДата());
	Сообщить("НачалоПримера");
	Сообщить(ТипXDTO.БазовыйТип);
	Сообщить("КонецПримера");
	
КонецЕсли;